POPULARITY BASED

In [1]:
import numpy as np
import pandas as pd

In [2]:
mr=pd.read_csv('movies.csv')
rr=pd.read_csv('ratings.csv')

In [3]:
mr.head()

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [4]:
rr.head()

   userId  movieId  rating   timestamp
0       1       16     4.0  1217897793
1       1       24     1.5  1217895807
2       1       32     4.0  1217896246
3       1       47     4.0  1217896556
4       1       50     4.0  1217896523

In [5]:
mr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10329 entries, 0 to 10328
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   movieId  10329 non-null  int64
 1   title    10329 non-null  object
 2   genres   10329 non-null  object
dtypes: int64(1), object(2)
memory usage: 242.2+ KB

In [6]:
rr.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 105339 entries, 0 to 105338
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     105339 non-null  int64
 1   movieId    105339 non-null  int64
 2   rating     105339 non-null  float64
 3   timestamp  105339 non-null  int64
dtypes: float64(1), int64(3)
memory usage: 3.2 MB

In [7]:
pr=rr.merge(mr,on="movieId")
pr.head()

   userId  movieId  rating   timestamp          title       genres
0       1       16     4.0  1217897793  Casino (1995)  Crime|Drama
1       9       16     4.0   842686699  Casino (1995)  Crime|Drama
2      12       16     1.5  1144396284  Casino (1995)  Crime|Drama
3      24       16     4.0   963468757  Casino (1995)  Crime|Drama
4      29       16     3.0   836820223  Casino (1995)  Crime|Drama

In [8]:
pr.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 105339 entries, 0 to 105338
Data columns (total 6 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     105339 non-null  int64
 1   movieId    105339 non-null  int64
 2   rating     105339 non-null  float64
 3   timestamp  105339 non-null  int64
 4   title      105339 non-null  object
 5   genres     105339 non-null  object
dtypes: float64(1), int64(3), object(2)
memory usage: 5.6+ MB

In [9]:
pr.shape

(105339, 6)

In [10]:
pr.drop_duplicates(inplace=True)
pr.shape

(105339, 6)

In [11]:
pr.corr()

C:\Users\sarmi\AppData\Local\Temp\ipykernel_2592\1611933941.py:1: FutureWarning: The default value of numeric_only in DataFrame.corr is deprecated. In a future version, it will default to False. Select only valid columns or specify the value of numeric_only to silence this warning.
  pr.corr()

             userId   movieId    rating  timestamp
userId     1.000000  0.089403 -0.044781   0.039862
movieId    0.089403  1.000000 -0.025446   0.518283
rating    -0.044781 -0.025446  1.000000   0.002697
timestamp  0.039862  0.518283  0.002697   1.000000

In [12]:
num_df=pr.groupby('title').count()['rating'].reset_index()
num_df.rename(columns={'rating':'no_rating'},inplace=True)
num_df

                                               title  no_rating
0                                         '71 (2014)          1
1            'Hellboy': The Seeds of Creation (2004)          1
2                             'Round Midnight (1986)          1
3                          'Til There Was You (1997)          3
4                                 'burbs, The (1989)         20
...                                              ...        ...
10318  loudQUIETloud: A Film About the Pixies (2006)          1
10319                                     xXx (2002)         24
10320                 xXx: State of the Union (2005)          7
10321                          ¡Three Amigos! (1986)         40
10322      À nous la liberté (Freedom for Us) (1931)          1

[10323 rows x 2 columns]

In [13]:
# import matplotlib.pyplot as plt
# import seaborn as sns
# sns.lineplot(x=num_df['title'],y=num_df['no_rating'])
# plt.show()

In [14]:
avg_df=pr.groupby('title').mean()['rating'].reset_index()
avg_df.rename(columns={'rating':'avg_rating'},inplace=True)
avg_df

C:\Users\sarmi\AppData\Local\Temp\ipykernel_2592\2477097475.py:1: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  avg_df=pr.groupby('title').mean()['rating'].reset_index()

                                               title  avg_rating
0                                         '71 (2014)    3.500000
1            'Hellboy': The Seeds of Creation (2004)    3.000000
2                             'Round Midnight (1986)    2.500000
3                          'Til There Was You (1997)    4.000000
4                                 'burbs, The (1989)    3.125000
...                                              ...         ...
10318  loudQUIETloud: A Film About the Pixies (2006)    4.500000
10319                                     xXx (2002)    2.958333
10320                 xXx: State of the Union (2005)    2.071429
10321                          ¡Three Amigos! (1986)    3.012500
10322      À nous la liberté (Freedom for Us) (1931)    3.000000

[10323 rows x 2 columns]

In [15]:
pop_df=num_df.merge(avg_df,on='title')
pop_df

                                               title  no_rating  avg_rating
0                                         '71 (2014)          1    3.500000
1            'Hellboy': The Seeds of Creation (2004)          1    3.000000
2                             'Round Midnight (1986)          1    2.500000
3                          'Til There Was You (1997)          3    4.000000
4                                 'burbs, The (1989)         20    3.125000
...                                              ...        ...         ...
10318  loudQUIETloud: A Film About the Pixies (2006)          1    4.500000
10319                                     xXx (2002)         24    2.958333
10320                 xXx: State of the Union (2005)          7    2.071429
10321                          ¡Three Amigos! (1986)         40    3.012500
10322      À nous la liberté (Freedom for Us) (1931)          1    3.000000

[10323 rows x 3 columns]

In [16]:
pop_df.no_rating.max() # max no. of rating in a movie

325

In [17]:
pop_df.no_rating.min() # min no. of rating in a movie

1

In [18]:
a=(325-1)/2
a

162.0

In [19]:
pop_df=pop_df[pop_df['no_rating']>=100].sort_values('avg_rating',ascending=False).head(100)

In [20]:
pop_df

                                            title  no_rating  avg_rating
8136             Shawshank Redemption, The (1994)        308    4.454545
3682                        Godfather, The (1972)        210    4.392857
9658                   Usual Suspects, The (1995)        228    4.328947
6137       Monty Python and the Holy Grail (1975)        154    4.301948
7950                      Schindler's List (1993)        248    4.296371
...                                           ...        ...         ...
6634                        Ocean's Eleven (2001)        119    3.743697
4603  Indiana Jones and the Temple of Doom (1984)        109    3.743119
4824                         Jerry Maguire (1996)        124    3.721774
4572                   In the Line of Fire (1993)        105    3.695238
1905              Clear and Present Danger (1994)        134    3.690299

[100 rows x 3 columns]

In [21]:
pop_df=pop_df.merge(pr,on='title').drop(['userId','movieId','timestamp','rating','no_rating'],axis=1).drop_duplicates()

In [22]:
pop_df

,title,avg_rating,genres
0,"Shawshank Redemption, The (1994)",4.454545,Crime|Drama
308,"Godfather, The (1972)",4.392857,Crime|Drama
518,"Usual Suspects, The (1995)",4.328947,Crime|Mystery|Thriller
746,Monty Python and the Holy Grail (1975),4.301948,Adventure|Comedy|Fantasy
900,Schindler's List (1993),4.296371,Drama|War
...,...,...,...
15075,Ocean's Eleven (2001),3.743697,Crime|Thriller
15194,Indiana Jones and the Temple of Doom (1984),3.743119,Action|Adventure|Fantasy
15303,Jerry Maguire (1996),3.721774,Drama|Romance
15427,In the Line of Fire (1993),3.695238,Action|Thriller
15532,Clear and Present Danger (1994),3.690299,Action|Crime|Drama|Thriller

In [23]:
import pickle
pickle.dump(pop_df,open('pop.pkl','wb'))